SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrda.menu.WDTtimeout.disabled=Disabled (recommended)
avrda.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrda.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrda.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrda.menu.WDTtimeout.1second=Window remains open for 1 Second
avrda.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrda.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrda.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrda.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrda.menu.WDTwindow.disabled=No delay before window "opens"
avrda.menu.WDTwindow.8seconds=8 Second before window "opens"
avrda.menu.WDTwindow.4seconds=4 Second before window "opens"
avrda.menu.WDTwindow.2seconds=2 Second before window "opens"
avrda.menu.WDTwindow.1second=1 Second before window "opens"
avrda.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrda.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrda.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrda.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrda.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrda.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrda.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrda.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrda.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrda.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrda.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrda.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrda.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrda.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrda.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrda.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrda.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrda.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrda.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrda.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrda.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrda.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # ####              #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DB parts   #
#________________________________________#
avrdb.upload.tool=avrdude
avrdb.upload.prog_interlock=
avrdb.build.board=avrdb
avrdb.build.mvioenable=-DMVIO_ENABLED
avrdb.build.core=dxcore
avrdb.build.f_cpu={build.speed}000000L
avrdb.build.text_section_start=.text=0x0
avrdb.build.extra_flags= {bootloader.appspm} {build.mvioenable}
avrdb.build.export_merged_output=false
avrdb.build.mcupostfix=
avrdb.build.printf=
avrdb.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdb.bootloader.tool=avrdude
avrdb.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdb.bootloader.wdtwindowbits=0000
avrdb.bootloader.wdttimeotbits=0000
avrdb.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdb.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdb.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdb.bootloader.CODESIZE=0x00
avrdb.bootloader.BOOTSIZE=0x01
avrdb.bootloader.avrdudestring=
avrdb.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdb.build.mcupostfix=
avrdb.build.printfabr=
avrdb.build.attachabr=
avrdb.build.wireabr=
avrdb.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DB submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
#________________________________________#
avrdb.menu.chip.avr128db28=AVR128DB28
avrdb.menu.chip.avr128db28.build.mcu=avr128db28
avrdb.menu.chip.avr128db28.upload.maximum_size=131072
avrdb.menu.chip.avr128db28.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db28.build.variant=28pin-standard
avrdb.menu.chip.avr128db32=AVR128DB32
avrdb.menu.chip.avr128db32.build.mcu=avr128db32
avrdb.menu.chip.avr128db32.upload.maximum_size=131072
avrdb.menu.chip.avr128db32.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db32.build.variant=32pin-standard
avrdb.menu.chip.avr128db48=AVR128DB48
avrdb.menu.chip.avr128db48.build.mcu=avr128db48
avrdb.menu.chip.avr128db48.upload.maximum_size=131072
avrdb.menu.chip.avr128db48.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db48.build.variant=48pin-standard
avrdb.menu.chip.avr128db64=AVR128DB64
avrdb.menu.chip.avr128db64.build.mcu=avr128db64
avrdb.menu.chip.avr128db64.upload.maximum_size=131072
avrdb.menu.chip.avr128db64.upload.maximum_data_size=16384
avrdb.menu.chip.avr128db64.build.variant=64pin-standard
avrdb.menu.chip.avr64db28=AVR64DB28
avrdb.menu.chip.avr64db28.build.mcu=avr64db28
avrdb.menu.chip.avr64db28.upload.maximum_size=65536
avrdb.menu.chip.avr64db28.upload.maximum_data_size=8192
avrdb.menu.chip.avr64db28.build.variant=28pin-standard
avrdb.menu.chip.avr64db32=AVR64DB32
avrdb.menu.chip.avr64db32.build.mcu=avr64db32
avrdb.menu.chip.avr64db32.upload.maximum_size=65536
avrdb.menu.chip.avr64db32.upload.maximum_data_size=8192
avrdb.menu.chip.avr64db32.build.variant=32pin-standard
avrdb.menu.chip.avr64db48=AVR64DB48
avrdb.menu.chip.avr64db48.build.mcu=avr64db48
avrdb.menu.chip.avr64db48.upload.maximum_size=65536
avrdb.menu.chip.avr64db48.upload.maximum_data_size=8192
avrdb.menu.chip.avr64db48.build.variant=48pin-standard
avrdb.menu.chip.avr64db64=AVR64DB64
avrdb.menu.chip.avr64db64.build.mcu=avr64db64
avrdb.menu.chip.avr64db64.upload.maximum_size=65536
avrdb.menu.chip.avr64db64.upload.maximum_data_size=8192
avrdb.menu.chip.avr64db64.build.variant=64pin-standard
avrdb.menu.chip.avr32db28=AVR32DB28
avrdb.menu.chip.avr32db28.build.mcu=avr32db28
avrdb.menu.chip.avr32db28.upload.maximum_size=32768
avrdb.menu.chip.avr32db28.upload.maximum_data_size=4096
avrdb.menu.chip.avr32db28.build.variant=28pin-standard
avrdb.menu.chip.avr32db32=AVR32DB32
avrdb.menu.chip.avr32db32.build.mcu=avr32db32
avrdb.menu.chip.avr32db32.upload.maximum_size=32768
avrdb.menu.chip.avr32db32.upload.maximum_data_size=4096
avrdb.menu.chip.avr32db32.build.variant=32pin-standard
avrdb.menu.chip.avr32db48=AVR32DB48
avrdb.menu.chip.avr32db48.build.mcu=avr32db48
avrdb.menu.chip.avr32db48.upload.maximum_size=32768
avrdb.menu.chip.avr32db48.upload.maximum_data_size=4096
avrdb.menu.chip.avr32db48.build.variant=48pin-standard

