SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
avrdb.menu.WDTtimeout.disabled=Disabled (recommended)
avrdb.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
avrdb.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
avrdb.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
avrdb.menu.WDTtimeout.1second=Window remains open for 1 Second
avrdb.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
avrdb.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
avrdb.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
avrdb.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
avrdb.menu.WDTwindow.disabled=No delay before window "opens"
avrdb.menu.WDTwindow.8seconds=8 Second before window "opens"
avrdb.menu.WDTwindow.4seconds=4 Second before window "opens"
avrdb.menu.WDTwindow.2seconds=2 Second before window "opens"
avrdb.menu.WDTwindow.1second=1 Second before window "opens"
avrdb.menu.WDTwindow.500msec=500 millisecond before window "opens"
avrdb.menu.WDTwindow.250msec=250 millisecond before window "opens"
avrdb.menu.WDTwindow.125msec=125 millisecond before window "opens"
avrdb.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
avrdb.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
avrdb.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
avrdb.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
avrdb.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
avrdb.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
avrdb.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
avrdb.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
avrdb.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
avrdb.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
avrdb.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
avrdb.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
avrdb.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
avrdb.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
avrdb.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
avrdb.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
avrdb.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
avrdb.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
avrdb.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#                                                                        #
###                 ###  #     # ####      ####  ####                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #   #             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  ####                  ###
#________________________________________________________________________#
#                                        #
# Parameters and defaults for DD parts   #
#________________________________________#
avrdd.upload.tool=avrdude
avrdd.upload.prog_interlock=
avrdd.build.board=avrdd
avrdd.build.mvioenable=-DMVIO_ENABLED
avrdd.build.core=dxcore
avrdd.build.f_cpu={build.speed}000000L
avrdd.build.text_section_start=.text=0x0
avrdd.build.extra_flags= {bootloader.appspm} {build.mvioenable}
avrdd.build.export_merged_output=false
avrdd.build.highestcb=B2
avrdd.build.printf=
avrdd.build.attachmode=-DCORE_ATTACH_ALL

#----------------------------------------#
# Bootloading parameters and fuses       #
#________________________________________#
avrdd.bootloader.tool=avrdude
avrdd.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
avrdd.bootloader.wdtwindowbits=0000
avrdd.bootloader.wdttimeotbits=0000
avrdd.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
avrdd.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrdd.bootloader.SYSCFG1=0b000{bootloader.mviobits}{bootloader.sutbits}
avrdd.bootloader.CODESIZE=0x00
avrdd.bootloader.BOOTSIZE=0x01
avrdd.bootloader.avrdudestring=
avrdd.bootloader.pymcuprogstring=-aerase

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
avrdd.build.mcupostfix=
avrdd.build.printfabr=
avrdd.build.attachabr=
avrdd.build.wireabr=
avrdd.build.appspmabr=.spm{bootloader.CODESIZE}

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# AVR-DD submenu options                     #
#____________________________________________#
# Chip (memory and pincount)             #
# 14/20-pin parts get default millis     #
# changed just like tinyAVRs do          #
#________________________________________#
avrdd.menu.chip.avr64dd32=AVR64DD32
avrdd.menu.chip.avr64dd28=AVR64DD28
avrdd.menu.chip.avr64dd20=AVR64DD20
avrdd.menu.chip.avr64dd14=AVR64DD14
avrdd.menu.chip.avr32dd32=AVR32DD32
avrdd.menu.chip.avr32dd28=AVR32DD28
avrdd.menu.chip.avr32dd20=AVR32DD20
avrdd.menu.chip.avr32dd14=AVR32DD14
avrdd.menu.chip.avr16dd32=AVR16DD32
avrdd.menu.chip.avr16dd28=AVR16DD28
avrdd.menu.chip.avr16dd20=AVR16DD20
avrdd.menu.chip.avr16dd14=AVR16DD14
avrdd.menu.chip.avr64dd32.build.mcu=avr64dd32
avrdd.menu.chip.avr64dd32.upload.maximum_size=65536
avrdd.menu.chip.avr64dd32.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr64dd20.build.highestcb=B2
avrdd.menu.chip.avr64dd28.build.mcu=avr64dd28
avrdd.menu.chip.avr64dd28.upload.maximum_size=65536
avrdd.menu.chip.avr64dd28.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr64dd20.build.highestcb=B2
avrdd.menu.chip.avr64dd20.build.mcu=avr64dd20
avrdd.menu.chip.avr64dd20.upload.maximum_size=65536
avrdd.menu.chip.avr64dd20.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd20.build.highestcb=B1
avrdd.menu.chip.avr64dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr64dd14.build.mcu=avr64dd14
avrdd.menu.chip.avr64dd14.upload.maximum_size=65536
avrdd.menu.chip.avr64dd14.upload.maximum_data_size=8192
avrdd.menu.chip.avr64dd14.build.highestcb=B1
avrdd.menu.chip.avr64dd14.build.variant=14pin-ddseries
avrdd.menu.chip.avr32dd32.build.mcu=avr32dd32
avrdd.menu.chip.avr32dd32.upload.maximum_size=32768
avrdd.menu.chip.avr32dd32.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr32dd28.build.mcu=avr32dd28
avrdd.menu.chip.avr32dd28.upload.maximum_size=32768
avrdd.menu.chip.avr32dd28.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr32dd20.build.mcu=avr32dd20
avrdd.menu.chip.avr32dd20.upload.maximum_size=32768
avrdd.menu.chip.avr32dd20.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd20.build.highestcb=B1
avrdd.menu.chip.avr32dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr32dd14.build.mcu=avr32dd14
avrdd.menu.chip.avr32dd14.upload.maximum_size=32768
avrdd.menu.chip.avr32dd14.upload.maximum_data_size=4096
avrdd.menu.chip.avr32dd14.build.highestcb=B1
avrdd.menu.chip.avr32dd14.build.variant=14pin-ddseries
avrdd.menu.chip.avr16dd32.build.mcu=avr16dd32
avrdd.menu.chip.avr16dd32.upload.maximum_size=16384
avrdd.menu.chip.avr16dd32.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd32.build.variant=32pin-ddseries
avrdd.menu.chip.avr16dd28.build.mcu=avr16dd28
avrdd.menu.chip.avr16dd28.upload.maximum_size=16384
avrdd.menu.chip.avr16dd28.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd28.build.variant=28pin-ddseries
avrdd.menu.chip.avr16dd20.build.mcu=avr16dd20
avrdd.menu.chip.avr16dd20.upload.maximum_size=16384
avrdd.menu.chip.avr16dd20.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd20.build.highestcb=B1
avrdd.menu.chip.avr16dd20.build.variant=20pin-ddseries
avrdd.menu.chip.avr16dd14.build.mcu=avr16dd14
avrdd.menu.chip.avr16dd14.upload.maximum_size=16384
avrdd.menu.chip.avr16dd14.upload.maximum_data_size=2048
avrdd.menu.chip.avr16dd14.build.highestcb=B1
avrdd.menu.chip.avr16dd14.build.variant=14pin-ddseries

