SpenceKonde/DxCore/megaavr/boards.txt
#----------------------------------------#
# WDT MODE                               #
#________________________________________#
azduinoboard.menu.WDTtimeout.disabled=Disabled (recommended)
azduinoboard.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
azduinoboard.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
azduinoboard.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
azduinoboard.menu.WDTtimeout.1second=Window remains open for 1 Second
azduinoboard.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
azduinoboard.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
azduinoboard.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
azduinoboard.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
azduinoboard.menu.WDTwindow.disabled=No delay before window "opens"
azduinoboard.menu.WDTwindow.8seconds=8 Second before window "opens"
azduinoboard.menu.WDTwindow.4seconds=4 Second before window "opens"
azduinoboard.menu.WDTwindow.2seconds=2 Second before window "opens"
azduinoboard.menu.WDTwindow.1second=1 Second before window "opens"
azduinoboard.menu.WDTwindow.500msec=500 millisecond before window "opens"
azduinoboard.menu.WDTwindow.250msec=250 millisecond before window "opens"
azduinoboard.menu.WDTwindow.125msec=125 millisecond before window "opens"
azduinoboard.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
azduinoboard.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
azduinoboard.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
azduinoboard.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
azduinoboard.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
azduinoboard.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
azduinoboard.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
azduinoboard.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
azduinoboard.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
azduinoboard.menu.WDTtimeout.63msec.bootloader.wdttimeoutbits=0100
azduinoboard.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
azduinoboard.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
azduinoboard.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
azduinoboard.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
azduinoboard.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
azduinoboard.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
azduinoboard.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
azduinoboard.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
azduinoboard.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100
